/**
 * 题目：将一个数组逆序输出。
___________________________________________________________________

程序分析：用第一个与最后一个交换。
___________________________________________________________________
*/
#include <stdio.h>

int main(int argc, char *argv[]){
    int a[10]={0, 1, 2, 3, 4, 5, 6, 7, 8, 9};
    for(int i = 0; i<10; i++){
        printf("%d ", a[i]);
    }
    printf("\n\n------------Reversed Order-------------\n");
    for(int i=9; i>=0; i--){
        printf("%d ", a[i]);
    }
    printf("\n");

    return 0;
}
